content/posts/interactive_ocaml_development.md
+++
title = "Interactive OCaml Development"
author = ["Samarth Kishor"]
date = 2020-03-08T22:06:00-04:00
lastmod = 2020-06-29T22:21:41-04:00
tags = ["OCaml", "programming"]
draft = false
+++

Interactive development features are mostly found in dynamically-typed
interpreted programming languages like Python or JavaScript. While OCaml is a
statically-typed compiled language, it is still possible to program in an
interactive style using a REPL. However, OCaml will never be quite as flexible
and interactive as something like Lisp because of its greatest feature: the
strong static type system.

## Testing functions using the REPL {#testing-functions-using-the-repl}

One of the nicest features of OCaml is that is has both a byte-code compiler
(`ocamlc`) and a native-code compiler (`ocamlopt`). This means that you can
develop programs in an interactive, [bottom-up](http://www.paulgraham.com/progbot.html) style using the REPL. Bottom-up
development is a technique most-often leveraged by Lisp programmers in which you
can write a single function, compile it and send it to the REPL, and then test
that function interactively in the REPL. OCaml's fast bytecode compiler makes it
possible to use this technique that is usually unique to Lisps and interpreted
languages.

### Sending code to the REPL in Emacs {#sending-code-to-the-repl-in-emacs}

I'll describe the process for interactive development using Emacs which is my
text editor of choice. Similar techniques should exist for other editors such as
VS Code or Vim.

OCaml's REPL is called `utop` and it has a lot of nice features that make it
well-suited for interactive development. If you're using Emacs, you can send
your OCaml code to `utop` to be evaluated. Here's an example of using `utop` to
test a single function.

```ocaml
open Base

let sum_list list = List.fold ~f:( + ) ~init:0 list
```

To send this code to `utop`, highlight it and press `C-x C-r` (or `M-x utop-eval-region RET`). You can even send an entire buffer to `utop` by pressing
`C-c C-b` via the function `utop-eval-buffer`. If you use the `dune` build
system and configure Emacs appropriately (instructions on how to do this are in
the [utop documentation](https://github.com/ocaml-community/utop#main-setup)), a dialog will pop up saying: "utop command line: opam
config exec -- dune utop . -- -emacs". Press `RET` to evaluate the code.

You might have seen a message saying "Error: unbound module Base". This code
uses [Jane Street's Base alternative standard library](https://opensource.janestreet.com/base/) which makes things a bit
more complicated, since `utop` does not know about Base by default.

To solve this, create a new file in the same directory called `.ocamlinit`.
`utop` reads this file before starting and executes the commands specified. You
just need to include a single line to load the Base library into `utop`:

```ocaml
#require "base";;
```

Now try the previous steps again to load the `sum_list` function into `utop`. If
this still doesn't work, make sure your `opam` environment is set up correctly
by running the command `opam switch` in a terminal and following the
instructions.

Once everything is working, go ahead and test the function in the REPL by
running `sum_list [1; 2; 3];;` (the double semicolons at the end of the line are
important because `utop` uses them to mark the end of an expression). If you
want to make changes to the function, simply switch back to the OCaml buffer,
edit the code, and send it back to `utop`.

### Working with multiple files in the REPL {#working-with-multiple-files-in-the-repl}

The technique I described above works great within a single file, but things get
complicated once you send code from multiple files to the same `utop` instance.
For example, say you made the `sum_list` function within a file called
`test.ml` and sent that code to `utop`. Now you want to use `Test.sum_list`
within another file, so you create a new file called `use_test.ml` which
implements a new function:

```ocaml
let double_sum_list list = (Test.sum_list list) * 2
```

Now when you go to send this new function to `utop`, you run into an error:
"Error: Unbound module Test".

Here's the full sample `utop` session:

```nil
utop[0]> open Base

let sum_list list = List.fold ~f:( + ) ~init:0 list
;;
val sum_list : int list -> int = <fun>
utop[1]> sum_list [1; 2; 3];;
- : int = 6
utop[2]> let double_sum_list list = (Test.sum_list list) * 2
;;

Error: Unbound module Test
```

Since OCaml isn't really made to be an interactive programming language, there
isn't a clean solution for this problem as far as I'm aware. However, you can
hack around this using the same `.ocamlinit` file that I mentioned before.

Kill `utop` and modify the `.ocamlinit` file to look like this:

```ocaml
#require "base";;
#mod_use "test.ml";;
```

The `#mod_use` function tells `utop` to import the given file into the REPL as a
module. This is important because it lets us call `sum_list` as `Test.sum_list`.
`#mod_use` essentially wraps up the functions from the file into a module and
sends that module to be evaluated in the REPL, which is basically how the OCaml
compiler treats OCaml files. We don't want to change our development style to
work with the REPL since `utop` is configurable enough.

There is one caveat with this approach: you have to edit `.ocamlinit` and
restart `utop` whenever you create a new file. If you switch files (say you were
sending code from `use_test.ml` to the REPL but now want to work with
`test.ml`), you have to restart `utop` each time to ensure that it has the most
up-to-date version of all your files/modules. This is a bit of a pain and I'm
not sure if there's a solution to this problem given OCaml's static nature.
