content/posts/interactive_ocaml_development.md

## Pretty-printing {#pretty-printing}

A major part of interactive development is seeing the results of functions in
the REPL. Since OCaml has a strong type system without dynamic dispatch, you can
only print strings---this means that you have to write functions to convert your
user-defined types (which are everywhere in idiomatic OCaml code) to strings
each time you want to print them. This is a pain, but luckily there's an elegant
solution: [ppx](https://github.com/ocaml-ppx/ppx%5Fderiving#plugin-show).

`ppx` is a syntax extension to OCaml which acts as a macro that automatically
generates code to pretty-print a custom type (`ppx_deriving.show`), generate
equality functions (`ppx_deriving.eq`), etc.

To pretty-print custom types annotated with `[@@deriving show]` in `utop`, you'll need to
once again modify the `.ocamlinit` file and add the following line:

```ocaml
#install_printer Module.pp;;
```

where `Module` is the name of the module which has the corresponding `pp`
function. Here's an example of one such module that pretty-prints a custom
hash-table with the `Depths` module, where `type t`... `[@@deriving show]` refers
to the `Resolver.t` type:

```ocaml
module Depths = struct
  type t = (string, int) Hashtbl.t

  let pp ppf values =
    Caml.Format.open_hovbox 1;
    Caml.Format.print_cut ();
    if Hashtbl.length values = 0
    then Caml.Format.fprintf ppf "@[<hov 2>{}@]"
    else (
      Caml.Format.fprintf ppf "@[<hov 1>{@ @]";
      Hashtbl.iteri values ~f:(fun ~key ~data ->
          Caml.Format.fprintf ppf "@[<hov 2>%s: %d,@ @]" key data);
      Caml.Format.fprintf ppf "@[<hov 1>}@]");
    Caml.Format.close_box ()
  ;;
end

type t =
  { statements : Parser.statement list
  ; scopes : Scopes.t
  ; depths : Depths.t
  ; parsed_statements : Parser.statement list
  }
[@@deriving show]
```

Here are the corresponding lines in `.ocamlinit` which tell `utop` which types
to pretty-print (the above code is from a file called `resolver.ml`):

```ocaml
#install_printer Resolver.pp;;
#install_printer Resolver.Depths.pp;;
```

Now `utop` knows to call the respective `pp` function whenever it needs to print
type information for the corresponding module. I needed to write the custom
`Depths.pp` function by hand since `ppx_deriving.show` is not powerful enough to
work for all custom types. This is one drawback of strong static type systems.
